DataFrame

In [3]:
import pandas as pd

In [5]:
l = [1,2,3,4,5]
var = pd.DataFrame(l)

In [11]:
var

   0
0  1
1  2
2  3
3  4
4  5

In [13]:
type(var)

pandas.core.frame.DataFrame

In [15]:
l1 = {"a":[1,2,3,4,5],"b":[1,2,3,4,5]}
var1 = pd.DataFrame(l1)

In [17]:
var1

   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [25]:
var1 = pd.DataFrame(l1,columns=["a"])

In [27]:
var1

   a
0  1
1  2
2  3
3  4
4  5

In [39]:
var1 = pd.DataFrame(l1,index=['p','q','r','s','t'])

In [41]:
var1

   a  b
p  1  1
q  2  2
r  3  3
s  4  4
t  5  5

In [43]:
l3 = {"Bangla":[55,67,86,45,75],"English":[34,57,78,97,54],"Math":[46,65,35,78,43]}
var3 = pd.DataFrame(l3,index=["Ajmayen","Sakib","Rakib","Setu","Hati"])
var3

         Bangla  English  Math
Ajmayen      55       34    46
Sakib        67       57    65
Rakib        86       78    35
Setu         45       97    78
Hati         75       54    43

In [49]:
var3["Bangla"]

Ajmayen    55
Sakib      67
Rakib      86
Setu       45
Hati       75
Name: Bangla, dtype: int64

In [51]:
var3["Bangla"]["Rakib"]

86

In [70]:
var3[:"Rakib"]

         Bangla  English  Math
Ajmayen      55       34    46
Sakib        67       57    65
Rakib        86       78    35

In [74]:
l4 = [[1,2,3,4,5],[34,56,78,90,76]]
var4 = pd.DataFrame(l4)
var4

    0   1   2   3   4
0   1   2   3   4   5
1  34  56  78  90  76

In [81]:
sr = {"s":pd.Series([1,2,3,4,5]),"r":pd.Series([2,3,4,5,6])}
var5 = pd.DataFrame(sr)

In [83]:
var5

   s  r
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6